Repository: ZenonSeth/logistica
Catalog: locale/logistica.*.po
Languages: ru

source: A multipurpose engineering tool. - Use (right-click on PC) it on Logistica nodes to get information about which network, if any, the node is connected to. This does not use or damage the Hyperspanner. - Sneak + Use it on a Logistica node to get more information about the network, if any, to which the machine is connected to. - Combined with a Photonizer or a Photonizer (Reversed Polarity) in the crafting grid, it will turn one into the other. This does not use or damage the Hyperspanner.
ru: Многофункциональный инженерный инструмент. - Используйте (ПКМ на ПК) его на узлах Логистики, чтобы получить информацию о том, к какой сети, если таковая есть, подключен узел. Это не расходует и не повреждает Гипергаечный ключ. - Зажмите Shift + Используйте его на узле Логистики, чтобы получить более подробную информацию о сети, если таковая есть, к которой подключена машина. - В сочетании с Фотонизатором или Фотонизатором (с обратной полярностью) в сетке крафта преобразует один в другой. Это не расходует и не повреждает Гипергаечный ключ.

source: Silverin Crystals are the base for other craft items, some of which can be made in the regular crafting grid, some of which require the use of the Lava Furnace (and are listed in the Lava Furnace's built-in crafting guide). See the Lava Furnace's built-in guide.
ru: Кристаллы Сильверина являются основой для других предметов крафта, некоторые из которых можно создать в обычной сетке крафта, а для других потребуется использование Лавовой печи (их рецепты указаны во встроенном справочнике Лавовой печи ([?]). См. встроенный справочник Лавовой печи.

source: 8 of them are Made from a single Silverin Crystal, the process can also be reversed - 8 slices = 1 crystal. They are used in the lava furnace as a basis for a few other crafting components, which in turn are used in many machines. See the Lava Furnace's built-in guide.
ru: 8 из них создаются из одного кристалла Сильверина, и процесс также можно обратить — 8 частей = 1 кристалл. Они используются в Лавовой печи как основа для некоторых других компонентов крафта, которые, в свою очередь, применяются во многих машинах. См. встроенный справочник Лавовой печи.

source: Made in the Lava Furnace, these circuits are used as basis for many machines. See the Lava Furnace's built-in guide.
ru: Создаются в Лавовой печи. Эти схемы используются как основа для многих машин. См. встроенный справочник Лавовой печи.

source: A piece of glass surrounded by sliverin crystals, and baked to perfection. This allows the creation of Wave Function Maintainer, which are in turn, the basis for all storage. See the Lava Furnace's built-in guide.
ru: Кусок стекла, окруженный кристаллами Сильверина, и закаленный до совершенства. Это позволяет создать Стабилизатор волновой функции, который, в свою очередь, является основой для всех хранилищ. См. встроенный справочник Лавовой печи.

source: Silverin Plates are made in the Lava Furnace using 1 Silverin Crystal as input and 1 Steel Ingot as additive. See furnace's built-in recipe guide for details. In addition to being used for the construction of almost all machines, the Silverin Plate can be placed as a node. 3 Silverin Plates can also make a Silverin Block, which is a purely decorateive item. This crafting process is reversible. See the Lava Furnace's built-in guide.
ru: Сильвериновые пластины изготавливаются в Лавовой печи, используя 1 кристалл Сильверина как входной материал и 1 стальной слиток как добавку. См. встроенный справочник рецептов Лавовой печи для подробностей. Помимо использования для создания почти всех машин, Сильвериновая пластина может быть размещена в мире как блок. 3 Сильвериновые пластины также могут создать Сильвериновый блок, который является чисто декоративным предметом. Этот крафт обратим. См. встроенный справочник Лавовой печи.

source: A tank capable of compressing liquids when used in the right machine. Used for creation of Reservoirs.
ru: Резервуар, способный сжимать жидкости при использовании в нужной машине. Используется для создания Резервуаров.

source: The regular Photonizer is made in normal crafting grid from other materials, but can also be made from a Reversed Polarity Photonizer using a Hyperspanner by combining them in the grid. The Photonizer (Reverse Polarity) is only made by comibing a hyperspanner and a normal Photonizer in the crafting grid. The Photonizer's job is to convert matter, aka items, into wave packets which can then be transmitted over the Logistic Network, and stored in machines. This is why the Photonizer is a vital component in any machine that can add items to the Logistics Network. The Revered Polarity Photonizer does the opposite - it takes wave packets and converts them into items. Thus it is used in many machines that are capable of taking items from the Logistics Network.
ru: Обычный Фотонизатор создается в обычной сетке крафта из других материалов, но также может быть сделан из Фотонизатора с обратной полярностью, используя Гипергаечный ключ, путем их сочетания в сетке. Фотонизатор (с обратной полярностью) создается только путем сочетания гипергаечного ключа и обычного Фотонизатора в сетке крафта. Задача Фотонизатора — преобразовать материю, то есть предметы, в волновые пакеты, которые затем могут быть переданы через Логистическую сеть и сохранены в машинах. Именно поэтому Фотонизатор является важным компонентом в любой машине, которая может добавлять предметы в Логистическую сеть. Фотонизатор с обратной полярностью делает противоположное — он принимает волновые пакеты и преобразует их в предметы. Таким образом, он используется в многих машинах, которые могут забирать предметы из Логистической сети.

source: The Wave Function Maintainer is a component that can "store" (aka maintain) wave packets indefinitely, when used in the right machine. This allows photonized matter to essentially be stored in it.
ru: Стабилизатор волновой функции — это компонент, который может «хранить» (то есть стабилизировать) волновые пакеты бесконечно долго, когда используется в нужной машине. Это позволяет фотонизированной материи фактически храниться в нем.

source: The wireless crystal is an essential component to crafting the Wireless Access Pad and Wireless Upgrader. It is made in the Lava Furnace. See furnace's built-in recipe guide for details
ru: Беспроводной кристалл — это важный компонент для крафта Беспроводной панели доступа и Беспроводного модернизатора. Он создается в Лавовой печи. См. встроенный справочник рецептов Лавовой печи для подробностей.

source: The Wireless Antenna is an essential component to crafting the Wireless Transmitter and Wireless Receiver. It is made on the regular crafting grid using the recipe above.
ru: Беспроводная антенна — это важный компонент для крафта Беспроводного передатчика и Беспроводного приемника. Она создается в обычной сетке крафта по рецепту выше.

source: A Controller is the node required to create an active network. Exactly one controller can be connected to a network, and removing it will disconnect all other devices connected to the network. Controllers allow you to rename the network, but this is for visual identification only, and naming two networks with the same name will not connect them together.
ru: Контроллер — это узел, необходимый для создания активной сети. К сети может быть подключен только один контроллер, и его удаление отключит все другие устройства, подключенные к сети. Контроллеры позволяют переименовывать сеть, но это нужно только для визуальной идентификации, и присвоение двум сетям одинакового имени не соединит их.

source: The Access Point provides easy access to all Storage devices connected to the Network. It can both take and insert items into the network's storage. It provides a Crafting Grid built into it for convenience. You can also access an Access Point and all its features remotely using a Wireless Access Pad synced to the Access Point. # Searching by text You can enter a search term to show items that term. A special search can be done by adding the groups: prefix at the start. For example groups:flower will match only items that have flower group set, thus it will display all flowers added by any mod. # Filtering You can filter items by: All items, Blocks only, Craft-items only, Tools only, Lights only # Sorting Items can also sorted by - Name: alphabetically sorted by the item's localized description to sort - Mod: alphabetically sorted by the item's technical name that is prefixed with the mod - Count: sorts by total item count, with largest first. - Wear: Sorts by item wear, with most uses remaining first (best used when filtering for Tools only) # Use Metadata button Some items, usually tools, have other information stored in them, like wear, descriptions or more complex metadata. If "Use Metadata" is ON, the Access Point will display these items individually. If it's OFF, the Access Point will group items with the same name, but different metadata into 1 stack. When taking such an item when Use Metadata is OFF, you will still receive an actual item with the correct wear and metadata, but it will be picked at random from the network. # Liquid Storage Below the Metadata button is a small section where the Access Point will show any Reservoirs connected to the network. You can use the two arrows to cycle through all liquids (if there are any). To deposit a liquid, just put a full bucket into the slot below the liquid image. It does not matter which liquid is selected for this, the Access Point will attempt to deposit it into the fullest applicable Reservoir, or assign the next smallest empty reservoir, if one is available. To withdraw a liquid, first select which liquid you want, then put an Empty Bucket into the slot below. The liquid will be taken from the least-full Reservoir holding that liquid type on the Network. # Taking items from the Network The Access Point shows a snapshot of available items, or items supplied by crafting suppliers. When you try to take an item, the Access Point makes a real request to the network. If the items are no longer available, you won't receive anything. In most cases the Access Point will try to show an error message informing what went wrong.
ru: Точка доступа предоставляет удобный доступ ко всем устройствам хранения, подключенным к сети. Она может как забирать, так и вставлять предметы в хранилище сети. Для удобства она предоставляет встроенную сетку крафта. Вы также можете удаленно получить доступ к Точке доступа и всем ее функциям, используя Беспроводную панель доступа, синхронизированную с Точкой доступа. # Поиск по тексту Вы можете ввести поисковый запрос, чтобы показать предметы, соответствующие этому запросу. Специальный поиск можно выполнить, добавив префикс 'groups:' в начале. Например, groups:flower покажет только предметы, у которых установлена группа 'flower', таким образом, будут отображены все цветы, добавленные любым модом. # Фильтрация Вы можете фильтровать предметы по: Все предметы, Только блоки, Только предметы для крафта, Только инструменты, Только источники света # Сортировка Предметы также можно отсортировать по - Название: сортировка по алфавиту, используя локализованное описание предмета - Мод: сортировка по алфавиту, используя техническое название предмета с префиксом мода - Количество: сортировка по общему количеству предметов, начиная с наибольшего. - Износ: сортировка по износу предмета, начиная с тех, у которых осталось больше всего использований (лучше всего использовать при фильтрации только по инструментам) # Использование метаданных Некоторые предметы, обычно инструменты, содержат дополнительную информацию, такую как износ, описания или более сложные метаданные. Если "Метаданные ON" (ВКЛЮЧЕНО), Точка доступа будет отображать эти предметы по отдельности. Если OFF (ВЫКЛЮЧЕНО), Точка доступа будет группировать предметы с одинаковыми названиями, но разными метаданными, в одну стопку. При взятии такого предмета, когда Использование метаданных ВЫКЛЮЧЕНО, вы все равно получите реальный предмет с правильным износом и метаданными, но он будет выбран случайным образом из сети. # Хранение жидкости Под кнопкой Метаданные есть небольшой раздел, где Точка доступа будет показывать все Резервуары, подключенные к сети. Вы можете использовать две стрелки для прокрутки всех жидкостей (если они есть). Чтобы внести жидкость, просто поместите полное ведро в слот под изображением жидкости. Не имеет значения, какая жидкость выбрана для этого, Точка доступа попытается внести ее в самый полный подходящий Резервуар, или назначит следующий самый пустой резервуар, если такой доступен. Чтобы извлечь жидкость, сначала выберите, какую жидкость вы хотите, затем поместите пустое ведро в слот ниже. Жидкость будет взята из наименее полного Резервуара, содержащего этот тип жидкости в сети. # Взятие предметов из сети Точка доступа показывает снимок доступных предметов или предметов, предоставляемых Поставщиками-крафтерами. Когда вы пытаетесь взять предмет, Точка доступа делает реальный запрос к сети. Если предметы больше не доступны, вы ничего не получите. В большинстве случаев Точка доступа попытается показать сообщение об ошибке, информируя, что что-то пошло не так.

source: # Regular Cables Cables are used to connect a controller to other machines, allowing the establishing of a network. Placing a cable that bridges two different active networks will burn that cable. Burned cables can simply be picked up, and return normal cables. Note that Cables are the only way to extend a network's reach - meaning, machines will not carry the network connection through them. If you connect a network cable to one side of a machine, and then place a 2nd cable on the other side of the machine, the 2nd cable will not carry the network connection. # Toggleable Cables The Toggleable Cable works exactly like a regular cable, but can be right-clicked (aka used) to disconnect it from all other surrounding cables or machines. This allows you to make parts of your network easy to disconnect when you don't want to use them (For example, a disconnecting an auto-furnace setup when you don't need it anymore) #Embedded Cables The Embedded Cable is a full block that acts like a regular Optic Cable, allowing cables to be run through walls without leaving visible gaps.
ru: # Обычные кабели Кабели используются для подключения контроллера к другим машинам, что позволяет создать сеть. Размещение кабеля, который соединяет две разные активные сети, приведет к его повреждению. Поврежденные кабели можно просто забрать, и они снова станут обычными кабелями. Обратите внимание, что кабели — это единственный способ расширить охват сети, то есть машины не могут передавать сетевое соединение через себя. Если вы подключите сетевой кабель к одной стороне машины, а затем установите второй кабель с другой стороны машины, второй кабель не передаст сетевое соединение. # Переключаемые кабели Переключаемый кабель работает точно так же, как обычный кабель, но его можно щелкнуть правой кнопкой мыши (или использовать), чтобы отключить его от всех окружающих кабелей или машин. Это позволяет вам легко отключать части вашей сети, когда вы не хотите их использовать (например, отключить авто-печь, когда она больше не нужна) # Встроенные кабели Встроенный кабель — это полноценный блок, который работает как обычный оптический кабель, позволяя проводить кабели через стены без видимых зазоров.

source: The Wireless Upgrader is a machine used to upgrade the Wireless Access Pad's range. To upgrade a Wireless Access Pad: 1. Craft the Wireless Upgrader 2. In the Wireless Upgrader put the Wireless Access Pad at the bottom slot, and 1 Wireless crystal in each top slot (see screenshot above) 3. You'll see two waves appear, one blue, one orange. The Orange wave is controlled by the buttons around the crystals. 4. Use the buttons around each Crystal to make the orange wave match the blue wave. 5. When they match, the wave turns Green and an Upgrade button appears. 6. Press the Upgrade button to increase your Wireless Access Pad's range. The Wireless Upgrader also has a "Hard Mode" toggleable via settings - see the "Server Settings" page on the left for info.
ru: Беспроводной модернизатор — это машина, используемая для улучшения дальности беспроводной панели доступа. Чтобы улучшить дальность беспроводной панели: 1. Скрафтите беспроводной модернизатор 2. Вставьте беспроводную панель в нижний слот беспроводного модернизатора и по 1 беспроводному кристаллу в каждый верхний слот (см. скриншот выше) 3. Вы увидите две волны: синюю и оранжевую. Оранжевая волна управляется кнопками вокруг кристаллов. 4. Используйте кнопки вокруг каждого кристалла, чтобы оранжевая волна совпала с синей. 5. Когда они совпадут, волна станет зеленой, и появится кнопка улучшения. 6. Нажмите кнопку улучшения, чтобы увеличить дальность вашей беспроводной панели доступа. Беспроводной модернизатор также имеет режим «Сложный», который можно включить через настройки — см. страницу «Настройки сервера» слева для информации.

source: Mass Storage node provide 1024 item storage for up to 8 different item types by default. This capacity can be upgraded with 4 upgrade lots and 2 different upgrades. Mass Storage needs to be configured with the exact items to store. You can collectively access all Mass Storage on a particular network from an Access Point/Wireless Access Pad. - Can be dug and keeps its Inventory when placed again, allowing easy moving of stored items - Can be upgraded to increase inventory size, up to maximum of 5120 items per slot - Select Front Image: Selects a stored node to display on the front of the storage node - Can Reserve a number of items per slot: Reserved items won't be taken by other machines on the network - Can quickly deposit items by punching it with a stack or sneak-punching it for deposit all stack items from your inventory - Pull items on/off: When On this storage will actively try to pull from any Supplier machines (e.g. Passive Supply Chests, Cobblegen Suppliers), except Crafting Suppliers.
ru: Массовое хранилище предоставляет место для 8 различных типов предметов по 1024 предмета на каждый (по умолчанию). Эта емкость может быть улучшена с помощью 4 слотов для улучшений и 2 различных улучшений. В массовом хранилище необходимо настроить предметы для хранения. Вы можете получить доступ ко всем массовым хранилищам на конкретной сети через точку доступа/беспроводную панель доступа. - Может быть удалено и сохраняет свое содержимое при повторном размещении, что позволяет легко перемещать хранимые предметы - Может быть улучшено для увеличения размера инвентаря, до максимума в 5120 предметов на слот - Выбрать изображение передней стороны: Выбирает хранимый блок для отображения на передней стороне хранлища - Может зарезервировать количество предметов на слот: Зарезервированные предметы не будут извлекаться другими машинами в сети - Можно быстро положить предметы, ударив по нему со стаком предметов в руке или ударив по нему, присев, чтобы положить все стаки этого предмета из инвентаря - Вытягивать предметы: Когда включено, это хранилище будет активно пытаться забрать предметы из любых поставляющих машин (например, из сундуков пассивного снабжения, генераторов булыжника), за исключением поставщиков-крафтеров.

source: The Tool Chest provides a large number of storage slots -- but it can only store tools (specifically, items that have a max stack size of 1). The Tool Chest is also accessed by Requesters to provide items. Tool Chest cannot be dug while it contains items (unlike Mass Storage, which will keep its inventory) You can also choose to sort the stored tools by Name, Mod or Wear.
ru: Сундук для инструментов предоставляет большое количество слотов для хранения, но может хранить только инструменты (точнее, предметы, у которых максимальный размер стака равен 1). Сундук для инструментов также используется Запросниками для предоставления предметов. Сундук с инструментами нельзя убрать, если он содержит предметы (в отличие от массового хранилища, которое сохраняет свое содержимое) Вы также можете выбрать сортировку хранимых инструментов по имени, моду или износу.

source: A Passive Supplier Chest acts as a regular chest, and a source for items for network requests. It has a small inventory, as it is not meant to be used for regular storage, but any item can be put in it. Passive Supplier Chests won't actively push items into the network, but Demanders and Mass Storage nodes can both take items from Suppliers when needed. Passive Supplier Chests have a toggle if they should also accept items to be stored in them from Network Importers.
ru: Сундук пассивного снабжения используется как обычный сундук и источник предметов для запросов сети. У него небольшой инвентарь, так как он не предназначен для регулярного хранения, но в него можно положить любые предметы. Сундуки пассивного снабжения не будут активно подавать предметы в сеть, но Запросники и Массовые хранилища могут забирать предметы из этих сундуков по мере необходимости. Сундуки пассивного снабжения имеют переключатель, позволяющий принимать предметы для хранения от Импортеров.
