Repository: ZenonSeth/logistica
Catalog: locale/logistica.*.po
Languages: ru

source: The trashcan is a node that deletes items. You can use it stand-alone without connecting it to a network - any time you delete an item it goes into the Last Deleted Item slot, allowing you to recover the very last item you deleted. Alternatively, you can also connect the Trashcan to a network. When connected it will delete any items that Network Importers push into the network that cannot be stored elsewhere. If you only want to delete specific items from the network (instead of all excess items) you can configure that with the filter slot - the the Trashcan will delete only items configured in its filter list.
ru: Мусорный бак — это блок, который удаляет предметы. Его можно использовать автономно, не подключая к Сети — каждый раз, когда вы удаляете предмет, он помещается в слот «Последний удалённый предмет», что позволяет восстановить последний удалённый предмет. В качестве альтернативы, Мусорный бак можно подключить к Сети. В подключённом состоянии он будет удалять все предметы, которые Импортёры Сети загружают в сеть и которые не могут быть сохранены в других местах. Если вы хотите удалять только определённые предметы из Сети (вместо всех лишних предметов), это можно настроить с помощью слота фильтра — Мусорный бак будет удалять только те предметы, которые указаны в его списке фильтров.

source: The Wireless Transmitter is a node that allows a network to be extended wirelessly, by connecting to a Wireless Receiver. It isn't necessary to use a Wireless Access Pad, as that synchronizes to an Access Point instead. Each network can only have 1 and only 1 Wireless Transmitter. In order to function, the Wireless Transmitter must be placed directly on top of the Network Controller. Once placed, it automatically starts to transmit the network, over an unlimited distance. If a Wireless Transmitter is dug or destroyed, or if the Network Controller below it is dug or destroyed, all connected Wireless Receivers will be disconnected, and must manually be re-connected once the Transmitter is placed. A wireless Transmitter has a limit of how many Receivers can be connected to it. This setting is configured by server, see the Server Settings guide page at the bottom of the list on the left.
ru: Беспроводной передатчик — это блок, который позволяет расширить сеть без кабелей, подключаясь к Беспроводному приёмнику. Он не требуется для Беспроводной панели доступа, так как она синхронизируется только с точкой доступа. Каждая сеть может иметь только 1 Беспроводной передатчик. Для работы Беспроводной передатчик должен быть установлен прямо на верхней части сетевого контроллера. После установки он автоматически начинает передавать сеть на неограниченное расстояние. Если Беспроводной передатчик будет выкопан или уничтожен, или если сетевой контроллер под ним будет выкопан или уничтожен, все подключённые Беспроводные приёмники будут отключены и их потребуется вручную переподключить после повторной установки передатчика. Беспроводной передатчик имеет ограничение на количество приёмников, которые могут быть к нему подключены. Этот параметр настраивается сервером, подробнее см. на странице руководства по настройкам сервера в нижней части списка слева.

source: The Wireless Receiver allows a network to be extended wirelessly, by connecting to a Wireless Transmitter. To use a Receiver, first place a Transmitter in a valid position (see its page for info) to allow the network to be wirelessly transmitted. Then place a Receiver in a valid position, such that it doesn't connect to an existing network. Then right click it and from the dropdown select the corresponding Network to connect to by name. Note that Networks can be renamed from their Network Controllers. Then press Connect - if successful, you will get a green "Connected" message. You can then connect Optic Cables to the Receiver and they will carry the network the Receiver was connected to. If you place a Receiver, and you cannot see your Network name (can happen after server/game restarts), first make sure the Network has a Wireless Transmitter attached to its controller. Then go and right click the Network Controller, which will make sure the network is active.
ru: Беспроводной приёмник позволяет расширить сеть без кабелей, подключаясь к Беспроводному передатчику. Чтобы использовать приёмник, сначала установите передатчик в подходящее место (см. его страницу для получения информации), чтобы сеть могла передаваться по беспроводной связи. Затем установите приёмник в подходящее место так, чтобы он не оказался подключенным кабелем к существующей сети. После этого щёлкните по нему правой кнопкой мыши и в выпадающем списке выберите соответствующую сеть по имени. Обратите внимание, что сети можно переименовать через их сетевые контроллеры. Затем нажмите «Подключить») — если всё выполнено успешно, вы увидите зелёное сообщение «Подключено». Теперь можно подключить оптические кабели к приёмнику, и они будут передавать сеть, к которой подключён приёмник. Если вы установили приёмник и не видите название своей сети (это может случиться после перезапуска сервера/игры), сначала убедитесь, что к сетевому контроллеру подключён Беспроводной передатчик. Затем щёлкните правой кнопкой мыши по сетевому контроллеру, чтобы убедиться, что сеть активна.

source: Current Server Settings for Logistica:
ru: Текущие настройки сервера для Логистики:

source: Guide Book to Logistica machines and concepts
ru: Руководство по машинам и концепциям Логистики

source: Crafting
ru: Создание

source: Go back
ru: Назад

source: Go forward
ru: Вперед

source: Recipe: @1 of @2
ru: Рецепт: @1 из @2

source: Related:
ru: См.также:

source: A Unit of Lava Use in Lava Furnace or with Empty Bucket
ru: Единица лавы Используйте в лавовой печи или в крафте с пустым ведром

source: Silverin Slice
ru: Сильвериновый лист

source: Silverin Circuit
ru: Сильвериновая схема

source: Silverin Mirror Box
ru: Зеркальный куб из сильверина

source: Photonizer E = M*C^2
ru: Фотонизатор E = M*C^2

source: Photonizer (Reversed Polarity) M = E/C^2
ru: Фотонизатор (обратная полярность) M = E/C^2

source: Cobble Generator Upgrade Increases Cobble Generator Output
ru: Улучшение генератора булыжника Увеличивает выход булыжника

source: Wireless Crystal For use in a Wireless Upgrader
ru: Беспроводной кристалл Для использования в беспроводном модернизаторе

source: Compression Tank Stores liquids at high pressure. Used for making Reservoirs.
ru: Бак высокого давления Хранит жидкости под высоким давлением. Используется для создания резервуаров.

source: Silverin Plate
ru: Сильвериновая пластина

source: Silverin Storage Upgrade Adds 512 Mass Storage Slot Capacity
ru: Сильвериновое улучшение хранилища Добавляет 512 слотов для массового хранилища

source: Diamond Storage Upgrade Adds 1024 Mass Storage Slot Capacity
ru: Алмазное улучшение хранилища Добавляет 1024 слота для массового хранилища

source: No Liquid Storage
ru: Нет хран. жидкостей

source: Free Capacity:
ru: Свободно:

source: Applies to Tools only: ON = Differentiate items using metadata OFF = Group items only by name, ignore metadata
ru: Применимо только к инструментам: ON = Различать предметы по метаданным OFF = Группировать предметы только по названию, игнорируя метаданные

source: Show All items
ru: Показать все предметы

source: Show Nodes only
ru: Показать только блоки

source: Show Craft items only
ru: Показать только предметы для крафта

source: Show Tools only
ru: Показать только инструменты

source: Show Light sources only
ru: Показать только источники света

source: Search by text Use group:some_group to find items belongong to some_group
ru: Искать текст Используйте group:some_group, чтобы найти предметы, которые принадлежат группе some_group

source: Clear search
ru: Очистить поиск

source: Filter
ru: Фильт.

source: Page
ru: Страница

source: <NONE>
ru: <НЕТ>

source: Metadata: ON
ru: Метаданные: ON

source: Metadata: OFF
ru: Метаданные: OFF

source: Network:
ru: Сеть:

source: Access Point not connected to any network
ru: Точка доступа не подключена к сети

source: Not enough space or allocated mass storage slots in network for item
ru: Не достаточно места или не задано слотов в хранилищах сети для предмета

source: Can't take a stack of size 0
ru: Невозможно взять стак с 0 предметов

source: No network
ru: Нет сети

source: Unknown liquid:
ru: Неизвестная жидкость:

source: Unknown filled bucket requested:
ru: Запрошено неизвестное полное вдеро:

source: Unknown full bucket:
ru: Неизвестное полное ведро:

source: Not enough empty buckets available
ru: Не достаточно пустых ведер

source: Not enough liquid available in network
ru: Не достаточно жидкости в сети

source: Name
ru: Имя

source: Mod
ru: Мод

source: Durability
ru: Износ

source: Lava Furnace can only use Lava as fuel
ru: Лавовая печь может использовать только лаву в качестве топлива

source: Use Chance:
ru: Шанс использования:

source: Lava Furnace Recipes
ru: Рецепты лавовой печи

source: Page:
ru: Страница:

source: (Has:
ru: (Содержит:

source: Reservoir
ru: Резервуар

source: @1 / @2 buckets
ru: @1 / @2 ведер

source: @1 / @2 buckets of @3
ru: @1 / @2 ведер @3

source: Max range of @1 reached, cannot upgrade WAP further
ru: Достигнут максимальный радиус @1, невозможно более улучшить панель доступа

source: Increase Frequency
ru: Увеличить частоту

source: Decrease Frequency
ru: Уменьшить частоту

source: Shift Right
ru: Сдвиг вправо

source: Shift Left
ru: Сдвиг влево

source: Target Wave
ru: Целевая волна

source: Crsyals' Wave
ru: Волна кристаллов

source: Upgrade
ru: Улучшение

source: Crystal
ru: Кристалл

source: Wireless Access Pad
ru: Беспроводная панель доступа

source: Someone is currently using this Upgrader!
ru: Кто-то сейчас использует этот модернизатор!

source: Wireless Transmitter for Network:
ru: Беспроводной передатчик для сети:

source: Lava Furnace [logistica]
ru: Лавовая печь [logistica]

source: Optic Cable
ru: Оптический кабель

source: Embedded Optic Cable
ru: Встроенный оптический кабель

source: Toggleable Cable
ru: Переключаемый кабель

source: Cobble Generator
ru: Генератор булыжника

source: Logistic Network Controller
ru: Контроллер сети Логистики

source: Crafting Supplier
ru: Поставщик-крафтер

source: Slow Network Importer Imports 10 items at a time
ru: Медленный импортер Импортирует 10 предметов за раз

source: Fast Network Importer Imports 99 items at a time
ru: Быстрый импортер Импортирует 99 предметов за раз

source: Tool Chest Stores Tools Only
ru: Сундук для инструмента Хранит только инструменты

source: Liquid Pump
ru: Насос

source: Item Request Inserter Inserts 1 item at a time
ru: Запросник предметов Вставляет 1 предмет за раз

source: Bulk Request Inserter Inserts up to 64 items at a time
ru: Массовый запросник предметов Вставляет до 64 предметов за раз

source: Passive Supplier Chest
ru: Сундук для пассивного снабжения

source: Vaccuum Supplier Chest
ru: Вакуумный сундук снабжения

source: Wireless Transmitter Must be placed on top of a Network Controller
ru: Беспроводной передатчик Устанавливается на Контроллер сети

source: Silverin Block
ru: Сильвериновый блок

source: Hyperspanner Use on node to see which network it belongs to Sneak + Use on node to see detailed network info
ru: Гипергаечный ключ Используйте на узле, чтобы увидеть к какой сети он принадлежит Присесть+ЛКМ на узле, чтобы увидеть детальную информацию о сети

source: Node has no connected network!
ru: Узел не подключен к сети!

source: Network
ru: Сеть

source: Network info for
ru: Информация о сети для

source: Inv List Scanner
ru: Сканнер списка инвентарей

source: Use in a Wireless Upgrader to initialize
ru: Используйте в беспроводном модернизаторе для инициализации

source: Wireless Access Pad Sneak+Punch an Access Point to Sync Range: @1
ru: Беспроводная панель доступа Присесть+Ударить по точке доступа для синхронизации Радиус: @1

source: This Wireless Access Pad is not initialized
ru: Эта беспроводная панель доступа не инициализирована

source: This Access Point is in a protected area!
ru: Эта точка доступа находится в защищенной области!

source: Synced to Access Point at
ru: Синхронизировано с точкой доступа в

source: This WAP is not synced to any Access Point.
ru: Эта панель доступа не синхронизирована с какой-либо точкой доступа.

source: The synced Access Point is too far away!
ru: Синхронизированная точка доступа слишком далеко!

source: The synced Access Point no longer exists!
ru: Синхронизированная точка доступа больше не существует!

source: The synced Access Point is in a protected area! How did you manage that?
ru: Синхронизированная точка доступа находится в защищенной области! Как вам это удалось?

source: Water
ru: Вода

source: River Water
ru: Речная вода
