Repository: ZenonSeth/logistica
Catalog: locale/logistica.*.po
Languages: ru

source: Network Importer are used to automatically take items from other nodes (e.g. furnaces) and add them to the network. To get a Network Importer working you must: - Place it facing a node that has an inventory it can access. Sneak + punch an importer to see its input position. - Select which inventory of the target node to take from - some nodes have multiple inventories, and one must be selected. - Make sure you press the Enable button to enable its functionality. - Optionally, you can configure the importer to only pull specific items by placing them in the Filter List. If the list is empty, the importer will indiscriminately attempt to pull any item, slot by slot, from its input node. - Optionally, select which machine types the importer will try to insert items into. Network importers scan 1 slot, and rotate which slot they take from each time they tick. Network Importers prioritize where they put their items in this order, assuming the type of machine to import into is enabled in the Importer's interface: - Fill the requests of any Requesters on the network - Fill any Mass or Item Storages (depending on whether item is stackable or not) that can handle this item - Fill any passive supply chests (if the chests are configured to accept items from the network) - Trash the item if there's any Trashcans connected that accept this kind of item. (see Trashcan) Using the Importer's GUI, you can enable or disable each of the 4 types of machines to import items into, and any disabled won't be added into. If no machine type is enabled to import into, then the Importer won't add any items at all. Note that even when a machine type is enabled, the Importer obeys the configuration of those machines, e.g. if a Passive Supply Chest is marked as "Don't allow storing from network" then the importer won't add into it. There's 2 version of the Network Importer: - Slow Network Importer: Takes up to 10 items from a slot at a time, and tries to insert it in the network. - Fast Network Importer: Takes up to 99 items from a slot at a time, and tries to insert them in the network. Note that how many items can be sent at one time to a Requester is still limited by the Requester itself (meaning an Item Requester will only receive 1 item, while a Stack Requester will receive up to 99). However when sending to Mass Storage or Passive Supply chests, the full stack the importer is capable of taking will be sent.
ru: Сетевой импортер используется для автоматического забора предметов из других узлов (например, печей) и добавления их в сеть. Чтобы сетевой импортер заработал, необходимо: - Разместить его, направив на блок, который имеет инвентарь, доступный для импорта. Присесть + удар по импортеру покажет позицию его входа. - Выбрать, из какого инвентаря целевого блока забирать предметы — некоторые блоки имеют несколько инвентарей, и нужно выбрать один из них. - Убедиться, что нажата кнопка «Вкл» (Включить) для активации функции. - При необходимости настроить фильтр предметов, указав в списке фильтра те, которые нужно забирать. Если список пуст, импортер будет забирать любые предметы, проходя по слотам блока. - При необходимости выбрать типы машин, в которые импортер будет пытаться вставить предметы. Сетевые импортеры сканируют один слот за раз и переключаются на следующий слот при каждом своем цикле. Сетевые импортеры приоритетно размещают предметы в следующем порядке (если тип машин включен в интерфейсе импортера): - Выполняют запросы любых запросников в сети - Заполняют любые массовые хранилища или хранилища инструмента (в зависимости от возможности укладки предмета в стак), которые могут обработать этот предмет - Заполняют любые сундуки пассивного снабжения (если сундуки настроены на прием предметов из сети) - Утилизируют предмет, если в сети есть мусорные баки, принимающие данный тип предметов (см. Мусорный бак) С помощью интерфейса импортера можно включать или отключать каждый из 4 типов машин для импорта предметов. Если ни один тип машин не включен, то импортер не будет добавлять предметы. Даже если тип машин включен, импортер будет учитывать их настройки, например, если пассивный сундук-поставщик отмечен как «Запретить хранение из сети», импортер не будет добавлять в него предметы. Существует 2 версии сетевых импортеров: - Медленный сетевой импортер: Забирает до 10 предметов из слота за раз и пытается вставить их в сеть. - Быстрый сетевой импортер: Забирает до 99 предметов из слота за раз и пытается вставить их в сеть. Обратите внимание, что количество предметов, которые можно отправить за раз запроснику, ограничено самим запросником (например, запросник предметов принимает только 1 предмет, а массовый запросник — до 99). Однако при отправке в массовые хранилища или сундуки пассивного снабжения будет отправлено столько предметов, сколько способен забрать импортер.

source: The Request Inserter is used to put items in other nodes outside the network. Note that while there item-wise and stack-wise Inserters, in ALMOST ALL you only need the item-wise Inserter. To use an Inserter, you must: - Place it facing a node that has an inventory it can target. Sneak + punching an inserter will show its output location. - Pick an inventory to place items into. Some nodes have multiple input inventories (e.g. a furnace) - Configure exactly which items to put in the target and how many - in the 4 upper slots. If not configured, nothing will be inserted. - Make sure you press the Enable button to enable operation - Request Inserters will request the configured items from the Network and try to keep its target's inventory full of at the minimum the specific items and the exact count. For example, a Request Inserter might be configured to target a Furnace's "fuel" inventory and always try to keep 2 Coal in it, while another request inserter targeting the same furnace, but it's "src" inventory can be configured to try and always keep 2 Iron Ore in it. - You can also check the "Inf" (short for "Infinite") checkbox to make the Request Inserter always request the item When the "Inf" checkbox below a slot is not checked, then the Inserter checks if the target inventory has at least as many items as the configured Inserter slot contains, and if there are fewer, then the requester will request the difference to try and reach the configured number. When the "Inf" checkbox below a slot is checked, then the Inserter won't check how many of that item are contained in the target inventory, but instead will request that amount of items every time interval (roughly every 1 second) and will attempt to put them in the target inventory, until there is no more room in that inventory. Request Inserters check for to obtain the items in the following order: - Any Suppliers (e.g. Passive Supply Chest, Vaccuum Chest, Cobble Gen Supplier or Crafting Supplier) - Mass Storage or Tool Box nodes (depending on the item needed) There's two variation of the Request Inserter, and as mentioned above in almost all cases you only need the item-wise Inserter. - Item Request Inserter: Moves 1 item at a time to fulfil the requested items. - Stack Request Inserter: Moves up to 99 items at a time to fulfil the requested items. Note that this does not mean it will insert 99 items, but rather it can insert up to 99 - it will still only insert as many as are necessary to meet the target number set by the filter list.
ru: Запросник предметов используется для добавления предметов в другие блоки за пределами сети. Обратите внимание, что существуют запросники предметов (item-wise) и массовые запросники стаков (stack-wise), но ПОЧТИ во ВСЕХ случаях вам нужен только запросник предметов. Чтобы использовать запросник, выполните следующие действия: - Разместите его так, чтобы он был направлен на блок с инвентарем, который он может нацелить. Присесть + удар по вставщику покажет его выходное местоположение. - Выберите инвентарь, в который нужно поместить предметы. Некоторые узлы имеют несколько входных инвентарей (например, печь). - Настройте, какие именно предметы нужно поместить в целевой блок и в каком количестве — это делается в 4х верхних слотах. Если настройка не выполнена, ничего вставлено не будет. - Убедитесь, что нажата кнопка «Вкл» (Включить) для активации работы. - Запросники будут запрашивать настроенные предметы из сети и пытаться поддерживать в целевом инвентаре заданные предметы в указанном количестве. Например, запросник может быть настроен на целевой инвентарь «fuel» (топливо) печи и всегда стараться поддерживать 2 угля в нем, в то время как другой запросник, нацеленный на «src» (источник), может быть настроен на поддержание 2х железных руд. - Также можно установить флажок «Inf» (сокращение от «Infinite», «Бесконечно»), чтобы запросник всегда запрашивал данный предмет. Когда флажок «Inf» под слотом не установлен, запросник проверяет, есть ли в целевом инвентаре нужное количество предметов, указанное в слоте настройки. Если предметов меньше, то запросник запрашивает разницу из сети, чтобы достичь указанного числа. Когда флажок «Inf» под слотом установлен, вставщик не проверяет количество предметов в целевом инвентаре, а вместо этого запрашивает указанное количество предметов через каждый интервал времени (примерно каждые 1 секунду) и пытается добавить их в целевой инвентарь до тех пор, пока в нем остается место. Запросники запрашивают предметы в следующем порядке: - Из любых поставщиков (например, сундук пассивного снабжения, вакуумный сундук, генератор булыжника или поставщик-крафтер) - Из массовых хранилищ или сундуков для инструмента (в зависимости от типа необходимого предмета) Существует две вариации запросников, и, как упомянуто выше, в большинстве случаев вам нужен только запросник предметов. - Запросник предметов: Перемещает по 1 предмету за раз для выполнения запроса. - Массовый запросник предметов: Перемещает до 99 предметов за раз для выполнения запроса. Обратите внимание, что это не означает, что он вставит 99 предметов, а лишь то, что он может вставить до 99 предметов — он все равно вставит только столько, сколько необходимо для достижения целевого числа, установленного в списке фильтров.

source: Reservoirs are portable nodes capable of storing liquids. To use one, place it on the ground, then right-click with a full or empty bucket to put or take liquid from it. Each reservoir stores only 1 liquid type. You can dig a reservoir and it will keep its liquid content when you place it again, which is why reservoirs are non-stackable items. Reservoirs also connect to a Logistic Network and can thus be accessed via both the Access Point and Wireless Access Pad. Reservoirs come in 2 variations: - Silverin: Stores up to 32 buckets of liquid - Obsidian: Stores up to 128 buckets of liquid
ru: Резервуары — это портативные блоки, способные хранить жидкости. Чтобы использовать резервуар, разместите его на земле, затем щелкните по нему правой кнопкой мыши с полным или пустым ведром, чтобы добавить или забрать жидкость. Каждый резервуар хранит только один тип жидкости. Вы можете выкопать резервуар, и он сохранит свое содержимое при повторной установке, поэтому резервуары не являются предметами, складываемыми в стак. Резервуары также подключаются к логистической сети, и к ним можно получить доступ через точку доступа и беспроводную панель доступа. Резервуары бывают двух видов: - Сильвериновый: вмещает до 32 ведер жидкости - Обсидиановый: вмещает до 128 ведер жидкости

source: The Pump is a machine that can automatically collect liquid nodes from the world and fill up Reservoirs. To use a Pump: - Place it directly above the liquid level, as in screenshot above, (no air gaps or solid blocks between - it there are gaps/nodes it won't work!) - Connect reservoirs by one of 2 methods: - Place Reservoirs directly adjacent to it, up to 4, one on each side - no Network connection required - Connect the Pump to a network on which Reservoirs are also connected - Enable the machine via its GUI The Pump will first fill out any adjacent Reservoirs before attempting to fill any Network-connected Reservoirs The Max Level setting tells the pump when to stop pumping liquid into a network. For example, if it's set to 30 and the pump is pumping water, once there are 30 buckets of water available in the network, the pump will not add more to the network reservoirs. If the amount on the network goes below 30, the pump will once again start pumping liquid until it reaches 30. Setting the Max to 0 will make the pump continuously pump liquid into the network without caring how much is already available. Note that the Max only applies to pumping into network reservoirs. Reservoirs that are directly connected to the pump (by being adjacent to it) will be filled to max capacity, regardless of the Max setting. Note that Renewable liquids (like Water) are not taken by the pump, allowing you to essentially have an unlimited supply of Water in your Logistics Network.
ru: Насос — это машина, которая может автоматически собирать жидкостные блоки из мира и наполнять резервуары. Как использовать насос: - Установите его прямо над уровнем жидкости, как на скриншоте выше (без воздушных промежутков или твердых блоков между насосом и жидкостью — если есть промежутки/блоки, насос не будет работать!) - Подключите резервуары одним из двух способов: - Разместите резервуары непосредственно рядом с насосом, до 4-х штук, по одному с каждой стороны — подключение к сети не требуется - Подключите насос к сети, к которой также подключены резервуары - Включите машину через её интерфейс (GUI) Насос сначала будет заполнять любые соседние резервуары, прежде чем пытаться заполнить резервуары, подключенные к сети. Параметр "Максимальный уровень" указывает насосу, когда нужно прекратить перекачку жидкости в сеть. Например, если он установлен на 30 и насос перекачивает воду, то как только в сети будет доступно 30 ведер воды, насос перестанет добавлять больше в сетевые резервуары. Если количество жидкости в сети упадет ниже 30, насос снова начнет качать жидкость, пока не достигнет 30. Установка параметра Max в 0 заставит насос непрерывно перекачивать жидкость в сеть, не обращая внимания на то, сколько её уже доступно. Обратите внимание, что параметр Max применяется только для перекачки в сетевые резервуары. Резервуары, подключенные напрямую к насосу (расположенные рядом с ним), будут заполняться до максимальной ёмкости, независимо от настройки Max. Также обратите внимание, что возобновляемые жидкости (например, вода) не расходуются насосом, что позволяет вам фактически иметь неограниченный запас воды в вашей сети.

source: The Bucket Filler machine connects to a network and can provide the specified filled bucket On-Demand (meaning only when something on the network needs it), much like crafting suppliers provide items on-demand. To use it: - Place Bucket Filler so it connects to network - Either provide empty buckets in its inventory, or ensure empty buckets are available as a supply on the network - Select the type of filled Bucket you want the machine to provide - You can also take filled buckets from it, or from an Access Point/Wireless Access Pad on the same network
ru: Наполнитель ведер подключается к сети и может предоставлять указанные наполненные ведра по запросу (т.е. только тогда, когда что-то в сети нуждается в них), аналогично тому, как поставщики-крафтеры предоставляют предметы по запросу. Как использовать: - Установите наполнитель ведер так, чтобы он был подключен к сети - Либо поместите пустые ведра в его инвентарь, либо убедитесь, что пустые ведра доступны в сети - Выберите тип наполненного ведра, который вы хотите, чтобы машина предоставляла - Вы также можете забирать наполненные ведра из машины или через точку доступа/беспроводную панель в той же сети

source: The Bucket Emptier accepts filled buckets into its inventory and attempts to empty them into any applicable reservoirs connected to the network. The resulting Empty Buckets are put in its output slot, and become available as a passive supply of empty buckets to the connected network Notes: - The Bucket Emptier's input inventory (where filled buckets go) is accessible by a Requester, which can insert items into it. - The machine has to be turned on to start processing filled buckets. - If no reservoir can accept the liquid, it will cycle to the next slot in its input.
ru: Опорожнитель ведер принимает наполненные ведра в свой инвентарь и пытается вылить их в любые подходящие резервуары, подключенные к сети. Пустые ведра помещаются в выходной слот и становятся доступными в качестве пассивного запаса пустых ведер для подключенной сети. Примечания: - Входной инвентарь машины (куда помещаются наполненные ведра) доступен для Запросников, которые могут вставлять туда предметы. - Машина должна быть включена, чтобы начать обработку наполненных ведер. - Если ни один резервуар не может принять жидкость, машина переключится на следующий слот во входном инвентаре.

source: The Crafting Supplier is a powerful on-demand supplier that crafts items on the fly, meaning it only crafts when asked for an item it can produce. For example: do you want to store only Steel Blocks in your network storage, but some of your machines need Steel Ingots? Put one of these machines on your network and it will automatically craft only as many Steel Ingots as your machines need! These machines also work recursively: if you have multiple Crafting Suppliers set up on your network, they can use each other to get materials they need. For example you can set up one Crafting Supplier to craft Mese Crystals from Mese Blocks, and another to craft Mese Shards from Mese Crystals. Then only store Mese Blocks in your Network storage and if any machine needs a Mese Shard, it will be crafted for you! These machines also interface with the Access Point and Wireless Access Pad, so you can take items that aren't stored on your network and they will be crafted by the Crafting Supplier for you!
ru: Поставщик-крафтер — это мощный поставщик по требованию, который создает предметы «на лету», то есть изготавливает их только тогда, когда запрашивается предмет, который он может произвести. Например: вы хотите хранить только стальные блоки в хранилище сети, но некоторые из ваших машин нуждаются в стальных слитках? Подключите эту машину к сети, и она автоматически изготовит ровно столько стальных слитков, сколько потребуется вашим машинам! Эти машины также работают рекурсивно: если в вашей сети настроено несколько Поставщиков-крафтеров, они могут использовать друг друга для получения необходимых материалов. Например, вы можете настроить один Поставщик-крафтер для создания кристаллов мезе из блоков мезе, а другой — для создания осколков мезе из кристаллов мезе. Тогда храните только блоки мезе в хранилище сети, и если какой-либо машине потребуется осколок мезе, он будет создан для вас! Эти машины также взаимодействуют с Точкой Доступа и Беспроводной Панелью Доступа, так что вы можете забирать предметы, которые не хранятся в вашей сети, и они будут изготовлены Поставщиком-крафтером для вас!

source: The Autocrafter is simple a non-network machine that simply crafts from its input to the output. It does not interface directly with a network but can be accessed by both Network Importers and Request Inserters to feed it to/from the network.
ru: Автокрафтер — это простая машина, не связанная с сетью, которая просто создает предметы из входных материалов и перемещает их на выход. Она не взаимодействует напрямую с сетью, но может использоваться как Импортёрами, так и Запросниками для передачи в сеть или из неё.

source: The Vaccuum Supply Chest acts like a regular Supply chest, providing items to the network when there's requests or storage pulls items. There are two differences: - As the name indicates, the Vaccuum chest will collect nearby dropped items, up to a distance of 3 blocks, into its inventory, automatically making them available for the Network. - It cannot be used by the Network to store items in it (unlike regular Supply Chests which can be configured to allow storing from the Network) The on/off switch in the Vaccuum Chests's inventory enables whether the chest will be collecting nearby items or not.
ru: Вакуумный Сундук работает как обычный сундук снабжения, предоставляя предметы в сеть, когда есть запросы или хранилища забирают предметы. Однако есть два отличия: - Как следует из названия, Вакуумный сундук будет собирать ближайшие выпавшие предметы на расстоянии до 3 блоков в свой инвентарь, автоматически делая их доступными для сети. - Его нельзя использовать для хранения предметов из сети (в отличие от обычных сундуков снабжения, которые можно настроить для хранения из сети). Переключатель в инвентаре Вакуумного Сундука включает или выключает функцию сбора ближайших предметов.

source: The Lava Furnace Fueler is a Network-connected machine that will attempt to re-fuel a Lava Furnace from any Reservoirs containing Lava that are connected to the network, thus allowing Automation of the Lava Furnace. When configured with a minimum level, it will refuel the Lava Furnace it points to by 1 bucket if the Lava Furnace's level drops below the set minimum fuel level. Note that you must have Reservoirs containing Lava connected to the same network and that the Fueler will take 1 bucket at a time each time it refuels a Lava Furnace.
ru: Заправщик Лавовой Печи — это устройство, подключенное к сети, которое будет пытаться автоматически заправить Лавовую Печь из любых Резервуаров с лавой, подключенных к сети, позволяя автоматизировать работу Лавовой Печи. Если задан минимальный уровень, заправщик будет заправлять Лавовую Печь на 1 ведро, если уровень топлива в печи опускается ниже установленного минимума. Обратите внимание, что необходимо иметь подключённые к сети Резервуары с лавой, и заправщик будет использовать по 1 ведру за раз для каждой заправки Лавовой Печи.

source: The Cobble Generator Supplier acts as a supplier that generates Cobble and stores a small buffer in its inventory, providing it as a passive supply to the Network its connected to. By default it produces 1 Cobble every 2 seconds, but can be upgraded to produce up to 4 every 2 seconds. Why a Cobble Generator when it's possible to make one with Lava and Water and a Node Breaker? The answer is: to reduce lag. Breaking a node causes a rather expensive update to the world, recalculating lighting and getting lava or water flowing updates to trigger. Instead, the Cobble Gen provides a far less intensive way to generate Cobble while still requiring the same materials - lava and water.
ru: Генератор булыжника действует как поставщик, который генерирует Булыжник и хранит небольшой запас в своём инвентаре, предоставляя его как пассивный ресурс в Сеть, к которой он подключён. По умолчанию он производит 1 Булыжник каждые 2 секунды, но может быть улучшен до 4 булыжников каждые 2 секунды. Зачем Генератор Булыжника, если его можно создать с помощью Лавы, Воды и Разрушителя Узлов? Ответ: чтобы снизить нагрузку. Разрушение блока вызывает дорогостоящее обновление мира, перерасчёт освещения и срабатывание обновлений потока лавы или воды. Вместо этого Генератор Булыжника предоставляет гораздо менее ресурсоёмкий способ генерировать Булыжник, при этом требуя тех же материалов — лавы и воды.
