Repository: ZenonSeth/logistica
Catalog: locale/logistica.*.po
Languages: ru

source: Provided with filled buckets, empties them into any network reservoirs
ru: Опорожняет полные ведра в любые резервуары сети

source: Resulting empty buckets are provided as passive supply to network
ru: Пустые ведра на выходе предоставляются для пассивного снабжения сети

source: Input: Filled Buckets to be emptied
ru: Вход: полные ведра для опорожнения

source: Enable
ru: Включить

source: If no Empty Buckets are added here, then they will be taken from the network.
ru: Если здесь нет Пустых Ведер, то они будут взяты из сети.

source: Error:
ru: Ошибка:

source: Supplies the selected filled buckets on-demand, if empty buckets are available
ru: Поставляет выбранные наполненные ведра по запросу, если доступны пустые

source: Optional Empty Buckets
ru: Опциональные пустые ведра

source: Supply
ru: Источник

source: Amount Available
ru: Количество доступно

source: Broken
ru: Сломанный

source: Upgrade slots: The 2 slots to the right are for placing cobble generator upgrades.
ru: Слоты улучшений: 2 слота справа для улучшений генератора булыжника.

source: Generates Cobblestone and passively supplies it to Network
ru: Генерирует булыжник и пассивно поставляет его в сеть

source: Network Name
ru: Имя сети

source: Set
ru: Установить

source: Controller of Network:
ru: Сетевой контроллер:

source: Recipe
ru: Рецепт

source: Output
ru: Выход

source: Input
ru: Вход

source: Crafts items when requested by Network. Excess stored below.
ru: Создает предметы по требованию сети. Избыток хранится снизу.

source: Excess items, provided as supply. If full, excess will be thrown out.
ru: Избыток предметов исп. для снабжения. Если полон - излишки будут выброшены.

source: Select what types of machines this Importer will put items into. Machine priority is from top to bottom, e.g. Trashcans, if enabled, are always the last machine type that items are put into.
ru: Выберите типы машин, в которые этот Импортер будет помещать предметы. Приоритет машин идет сверху вниз, например, мусорные баки, если они включены, всегда будут последними машинами, в которые помещаются предметы.

source: Put in (?):
ru: Куда (?):

source: Requesters
ru: Запросники

source: Mass/Item Storage
ru: Масс./Предм. хран.

source: Supply Chests
ru: Сундуки снабж.

source: Trashcans
ru: Мус. баки

source: Network Importer take items from target and add them to the network
ru: Импортер забирает предметы из цели и добавляет их в сеть

source: Filter: Import only filtered. If empty, imports all items.
ru: Фильтр: Импортировать только эти предметы. Если пуст - будет импорт-ся всё.

source: Take items from:
ru: Забрать предметы из:

source: Tool Chest: Accepts only tools, no stackable items
ru: Сундук для инструментов: принимает только инструменты - не стакающиеся предметы.

source: Sort
ru: Сорт.

source: Remaining:
ru: Осталось:

source: Buckets
ru: ведер

source: Lava
ru: Лава

source: Additives
ru: Добавки

source: Crafts unique recipes (click ? button in top right)
ru: Готовит уник. рецепты (нажмите кнопку ? в верхнем правом углу)

source: and can also cook regular recipes at twice the speed
ru: Также может приготовить обычные рецепты на удвоенной скорости

source: Recipes
ru: Рецепты

source: Refuel if level below:
ru: Заправлять, если уровень ниже:

source: Lava Furnace Fueler: Refuels Lava Furnace
ru: Заправщик лавовой печи: заправляет печь лавой

source: from Reservoirs connected to Network
ru: из резервуаров, подключенных к сети

source: Refuel when lava drops below:
ru: Заправлять, когда уровень лавы упадет ниже:

source: How many items to reserve. Reserved items won't be taken by other network machines
ru: Количество резервируемых предметов. Зарезервированные предметы не будут забираться другими машинами сети.

source: Pick which slot to use as front image. Click the selected slot again to disable the front image.
ru: Выберите, какой слот использовать для фронтальной картинки Кликните на выбранный слот снова, чтобы отключить фронтальную картинку.

source: Place item to select what kind of item to store in each slot.
ru: Поместите предмет, чтобы выбрать какие предметы хранить в каждом слоте.

source: Upgrade slots: The 4 slots to the right are for placing mass storage upgrades.
ru: Слоты улучшений: 4 слота справа - для улучшений массового хранилища.

source: Storage slots: items can be taken from them. To add items, put them in the input slot below.
ru: Слоты хранилища: предметы можно забирать из них. Для добавления предметов,поместите их во входной слот.

source: Input slot: Place items here (or shift+click items to send them here) to put them in storage
ru: Входной слот: поместите предметы сюда (или shift+клик на предмете, чтобы отправить его сюда), чтобы положить их в хранилище

source: If ON, this mass storage will try to take stored items from Suppliers (except Crafting Suppliers) if it can store them.
ru: Если ON, это массовое хранилище будет пытаться взять хранимые предметы из поставщиков (за исключением поставщиков для крафта)

source: Front Img
ru: Изобр.

source: Res (?)
ru: Рез. (?)

source: Pull Items
ru: Брать предметы

source: Mass Storage
ru: Массовое хранилище

source: (Empty)
ru: (Пусто)

source: Pumps liquids directly into neighbouring reservoirs (one on each side)
ru: Закачивает жидкости напрямую в соседние резервуары (по одному на каждой

source: Or if there are none, or are full, pumps into any network reservoirs
ru: стороне) или если их нет, или полные - закачивает в любые резервуары сети

source: Max horizontal range, on each side of pump:
ru: Макс. горизонтальное расстояние от каждой стороны насоса:

source: Max vertical range, starting below the pump:
ru: Макс. вертикльное растояние, начиная с блока под насосом:

source: MUST be placed directly above liquid surface, without gaps to liquid
ru: ДОЛЖЕН устанавливаться над поверхностью жидкости, без зазоров

source: Max Network Amount: If Network has more than this amount of liquid, don't pump any more. Set to 0 to ALWAYS pump into network. Only applies to pumping into network.
ru: Максимальное количество: если в сети больше этого количества жидкости, то закачка остановится. Установите 0, чтобы ВСЕГДА качать в сеть. Применяется только к закачке в сеть.

source: Max:
ru: Макс:

source: Tick this to always try to insert the item above into the target inventory, regardless of how many of that item the target inventory contains. The number of items put above is then requested every second.
ru: Отметьте, чтобы всегда пытаться вставить указанный выше предмет в целевой инвентарь, независимо от того, сколько таких предметов содержится в целевом инвентаре. Количество вставляемых предметов будет запрашиваться каждую секунду.

source: Put items in:
ru: Вставлять предм. в:

source: Configure items and count to put, and keep a minimium of, in target's inventory
ru: Настройте предметы и их кол-во для вставки, а также мин. кол-во, в инвентаре

source: Or tick the "Inf" (infinite) checkbox below a slot to always keep inserting the item.
ru: Или отметьте "Inf" (бесконечно) под слотом, чтобы всегда вставлять этот предмет.

source: Allow Storing from Network
ru: Разрешить хранение из сети

source: Passive Supplier Items become available to network requests.
ru: Пассивный поставщик Предметы могут быть извлечены сетью.

source: List of Items to delete, if they can't be put elsewhere in the Network.
ru: Список предметов для удаления, если их нельзя разместить в другом месте в сети.

source: If list is empty, it will delete all excess items.
ru: Если список пуст, будут удалены все избыточные предметы.

source: Trash slot
ru: Слот для мусора

source: Last deleted item
ru: Последний удаленный предмет

source: Vaccuum items:
ru: Засасывать предметы:

source: Supplies collected items to the network.
ru: Предоставить собранные предметы сети.

source: Wireless Receiver
ru: Беспроводной приемник

source: Choose a network to connect to.
ru: Выберите сеть для подключения.

source: Connect
ru: Подключить

source: Only your networks with a Wireless Transmitter can be connected to.
ru: Можно подключаться только к Вашим сетям с беспроводным передатчиком.

source: If a network isn't showing up, go near its controller to reactivate it.
ru: Если сеть не отображается, подойдите к ее контроллеру, чтобы активировать.

source: Connected!
ru: Подключено!

source: Failed to connect!
ru: Не удалось подключиться!

source: Invalid Placement!
ru: Недопустимое размещение!

source: Transmitter must be placed on top of a Network Controller
ru: Передатчик должен быть установлен на сетевой контроллер

source: Transmitting Network:
ru: Передающая сеть:

source: Receivers connected:
ru: Подключено приемников:

source: out of max:
ru: из макс.:

source: Wireless Transmitter
ru: Беспроводной передатчик

source: Lava Furnace
ru: Лавовая печь

source: Logistica Guide
ru: Руководство Логистики

source: Intro
ru: Введение

source: How To:
ru: Начало:

source: Get Started: The Lava Furnace
ru: Начало: Лавовая печь

source: Create a Logistic Network
ru: Создание сети Логистики

source: Move items from/to other mods
ru: Перемещение предметов из/в другие моды

source: General Machines:
ru: Машины:

source: Network Controller
ru: Контроллер сети

source: Access Point
ru: Точка доступа

source: Optic Cables
ru: Оптический кабель

source: Storage:
ru: Хранение:

source: Mass Storage
ru: Массовое хранилище

source: Tool Chest
ru: Сундук для инструментов

source: Passive Supplier Chest
ru: Сундук для пассивного снабжения

source: Moving Items:
ru: Перемещение предметов:

source: Network Importer
ru: Импортер

source: Request Inserter
ru: Запросник предметов

source: Wireless Network
ru: Беспроводная сеть

source: Wireless Transmitter
ru: Беспроводной передатчик

source: Wireless Receiver
ru: Беспроводной приемник

source: Wireless Access Pad
ru: Беспроводная панель доступа

source: Wireless Upgrader
ru: Беспроводной модернизатор

source: Liquid Storage:
ru: Хранение жидкостей:

source: Reservoirs
ru: Резервуары

source: Reservoir Pump
ru: Насос для резервуара

source: Bucket Filler
ru: Наполнитель ведер

source: Bucket Emptier
ru: Опорожнитель ведер

source: Autocrafting:
ru: Автокрафт:

source: Crafting Supplier
ru: Поставщик-крафтер

source: Autocrafter
ru: Автокрафтер

source: Utility Machines:
ru: Вспомогательные машины:

source: Vaccuum Chest
ru: Вакуумный сундук

source: Lava Furnace Fueler
ru: Заправщик лавовой печи

source: Cobble Generator
ru: Генератор булыжника

source: Trashcan
ru: Мусорный бак

source: Machine Upgrades:
ru: Улучшения машин:

source: Mass Storage Upgrades
ru: Улучшения массового хранилища

source: Cobble Generator Upgrades
ru: Улучшения генератора булыжника

source: Tools:
ru: Инструменты:

source: Hyperspanner
ru: Гипергаечный ключ

source: Items:
ru: Предметы:

source: Silverin Crystal
ru: Кристалл сильверина

source: Silverin Slice
ru: Сильвериновый лист

source: Silverin Circuit
ru: Сильвериновая схема

source: Silverin Mirror Box
ru: Зеркальный куб из сильверина

source: Silverin Plate
ru: Сильвериновая пластина

source: Compression Tank
ru: Бак высокого давления

source: Photonizer/Reverse Polarity
ru: Фотонизатор/обратная полярность

source: Wave Function Maintainer
ru: Стабилизатор волновой функции

source: Wireless Crystal
ru: Беспроводной кристалл

source: Wireless Antenna
ru: Беспроводная антенна

source: Misc:
ru: Разное:

source: Server Settings
ru: Настройки сервера

source: Intro to Logistica
ru: Введение в Логистику

source: Getting started with Logistica
ru: С чего начать в Логистике

source: Create a Logistic Network
ru: Создание сети Логистики

source: Moving items from/to other mod's machines or storage
ru: Перемещение предметов из/в машины или хранилище других модов

source: Network Controller
ru: Контроллер сети

source: Access Point
ru: Точка доступа

source: Optic cables
ru: Оптические кабели

source: Wireless Upgrader
ru: Беспроводной модернизатор

source: Network Importer
ru: Импортер

source: Request Inserter
ru: Запросный вставщик

source: The Wireless Access Pad
ru: Беспроводная панель доступа

source: Liquid Reservoirs
ru: Жидкостные резервуары

source: Resevoir Pump
ru: Насос для резервуара

source: Bucket Emptier
ru: Опорожнитель ведер

source: Bucket Filler
ru: Наполнитель ведер

source: Crafting Supplierr
ru: Поставщик-крафтер

source: Autocrafter
ru: Автокрафтер

source: Vaccuum Chest
ru: Вакуумный сундук

source: Lava Furnace Fueler
ru: Заправщик лавовой печи

source: Cobblestone Generator
ru: Генератор булыжника

source: Trashcan
ru: Мусорный бак

source: Mass Storage Upgrades
ru: Улучшения массового хранилища

source: Cobblestone Generator Upgrades
ru: Улучшения генератора булыжника

source: Hyperspanner
ru: Гипергаечный ключ

source: Silverin Crystal
ru: Кристалл сильверина

source: Silvrin Silce
ru: Сильвериновый лист

source: Silvrin Circuit
ru: Сильвериновая схема

source: Mirror Box
ru: Зеркальный куб

source: Silvrin Plate
ru: Сильвериновая пластина

source: Compression Tank
ru: Бак высокого давления

source: Photonizer and Reverse Polarity Photonizer
ru: Фотонизатор и Фотонизатор обратной полярности

source: Wave Function Maintainer
ru: Стабилизатор волновой функции

source: Wireless Crystal
ru: Беспроводной кристалл

source: Wireless Antenna
ru: Беспроводная антенна

source: Server Settings
ru: Настройки сервера

source: Logistica is an item storage and transportation mod. It provides easy to use storage that can be used standalone, or connected to a logistic network. The Logistic network is able to transport items - both taking from other mod's machines and inserting items into them. The network transportation works on-demand: only the exact amount of items needed are moved. Logistica also provides a way to access all your storage remotely, from potentially unlimited distance (configured per server). To see how to get started, click the 'Get Started' entry in the list on the left.
ru: Логистика (Logistica) — это мод для хранения и транспортировки предметов. Он предоставляет простое в использовании хранилище, которое можно использовать автономно или подключить к логистической сети. Логистическая сеть позволяет транспортировать предметы — как забирать их из машин других модов, так и помещать предметы в них. Транспортировка в сети работает по запросу: перемещается только то количество предметов, которое необходимо. Logistica также предоставляет возможность удаленного доступа ко всем вашим хранилищам, с потенциально неограниченного расстояния (настраивается для каждого сервера). Чтобы узнать, как начать, нажмите на пункт 'Начало' в списке слева.

source: In order to construct all other Logistica machines, you need a unique material: Silverin Crystals, which are made in a Lava Furnace. The Lava Furnace can only be fueled by Lava. Place lava buckets in the lower left slot to fuel it manually, or later construct a Lava Fueler. The Lava Furnace has a built-in recipe guide, accessed by clicking the [?] button in the upper right corner. There are 2 recipes for Silverin Crystals, one that uses Snow as the additive, one that uses Ice. Both recipes use 25 milibuckets of Lava (that's 25/1000 of a full bucket) so 1 bucket of fuel can make 40 Silverin Crystals. The Lava Furnace can also cook regular recipes in half the regular cooking time, but at the cost of using a bit of lava. For normal items it uses 5 milibuckets (0.005 buckets) of lava per second of cooking time.
ru: Для создания всех машин Логистики вам потребуется уникальный материал: кристаллы Сильверина, которые производятся в Лавовой печи. Лавовую печь можно заправлять только лавой. Поместите ведра с лавой в нижний левый слот для ручной заправки или позже создайте Заправщик лавовой печи. В Лавовой печи есть встроенный справочник рецептов, доступ к которому можно получить, нажав на кнопку [?] в правом верхнем углу. Существует 2 рецепта для создания кристаллов Сильверина: один с использованием снега в качестве добавки и другой с использованием льда. Оба рецепта требуют 25 милливедер лавы (это 25/1000 от полного ведра), так что 1 ведро топлива может создать 40 кристаллов Сильверина. Лавовая печь также может готовить обычные рецепты вдвое быстрее обычного времени, но с расходом небольшого количества лавы. Для обычных предметов требуется 5 милливедер (0.005 ведра) лавы за каждую секунду времени готовки.

source: You can use all storages as stand-alone nodes. However if you want to access all your storage from one place OR you want to import items from other machines or distribute items to other machines, you need to create a Logistic Network and connect your storages to it. To create a Logistic Network you need a Network Controller (click button above for more info). A network can have at most 1 Network Controller, trying to connect more will disable the newly connected ones. Once you have a Network Controller, use Optic Cables to connect the controller to all machines: storage, injectors, importers, etc can all be connected to a network. There are only a few machines that are not network connectable, such as the Autocrafter, but in those cases you can use Network Importers and Request Inserters to interact with them.
ru: Вы можете использовать все хранилища как автономные блоки. Однако, если вы хотите получить доступ ко всем вашим хранилищам из одного места ИЛИ если вы хотите импортировать предметы из других машин или распределять предметы по другим машинам, вам необходимо создать Логистическую сеть и подключить к ней ваши хранилища. Для создания Логистической сети вам потребуется Контроллер сети (нажмите на кнопку выше для получения дополнительной информации). В сети может быть не более 1 Контроллера сети, попытка подключить больше отключит вновь подключенные контроллеры. Как только у вас есть Контроллер сети, используйте Оптические кабели для подключения контроллера ко всем машинам: хранилища, запросники, импортеры и другие устройства могут быть подключены к сети. Есть только несколько машин, которые нельзя подключить к сети, например, Автокрафтер, но в таких случаях вы можете использовать Импортеры сети и Запросники предметов для взаимодействия с ними.

source: Logistica allows you to access the inventories of machines or storage from other mods - both to take and insert items. # Taking Items To take items from machines of other mods, or storage of other mods, you can use a Network Importer - see button above for details. In the rare case where the network importer cannot access the inventory of a machine or storage, try to use machines from the other mod to put all the items in a regular Chest, then use the Network Importer to take items from the Chest. # Placing Items To place items into other mahcines, ues a Request Inserter - see button above for details. # What NOT to do Don't try to use Passive Supply chests as outputs of other mod's machines. Passive Supply chests have no direct compatibility with other mods, and are just a utility for personal storage.
ru: Логистика позволяет получать доступ к инвентарям машин или хранилищ из других модов — как для извлечения, так и для помещения предметов. # Извлечение предметов Чтобы забирать предметы из машин или хранилищ других модов, используйте Импортер сети — подробнее смотрите, нажав на кнопку выше. В редких случаях, если Импортер сети не может получить доступ к инвентарю машины или хранилища, попробуйте использовать машины из другого мода, чтобы поместить все предметы в обычный сундук, а затем используйте Импортер сети для извлечения предметов из сундука. # Помещение предметов Чтобы помещать предметы в другие машины, используйте Запросик предметов — подробнее смотрите, нажав на кнопку выше. # Что НЕ следует делать Не пытайтесь использовать Сундуки пассивного снабжения в качестве выходов для машин других модов. Сундуки пассивного снабжения не имеют прямой совместимости с другими модами и предназначены исключительно для личного хранения.

source: Mass Storage upgrades increase the capacity of the Mass Storage machine. There are two types, as seen above. Note that you cannot remove Mass Storage upgrades from a Mass Storage machine if removing the upgrade will result in insufficient storage available for any of the stacks stored in the machine.
ru: Улучшения Массового хранилища увеличивают вместимость Массового хранилища. Существует два типа улучшений, как показано выше. Обратите внимание, что вы не можете удалить улучшения Массового хранилища из машины, если удаление улучшения приведет к недостаточному объему хранилища для каких-либо стаков, уже находящихся в хранилище.

source: Cobblestone Generator Upgrades are added the Cobble Generator Supplier. Each upgrade doubles the rate of cobblestone output.
ru: Улучшения Генератора булыжника вставляются в соответствующую машину. Каждое улучшение удваивает скорость генерации булыжника.

source: The Wireless Access Pad is a handheld device that allows you to access your Network Storage from potentially unlimited distance by synchronizing to an Access Point on your network. (distance may be limited by server settings, see Server Setting page on the left) The Wireless Access Pad has no relation to the Wireless Transmitter or Receiver. The Pad only requres an Access Point. The Wireless Access Pad provides the exact same interface as the Access Point, allowing you to store or retrieve items or liquids. To use a Wireless Access Pad: 1. Craft one via the recipe. Tip: the Wireless Crystals are made in a Lava Furnace. 2. Craft a Wireless Upgrader machine, and use it to Upgrade your Wireless Access Pad as many times as you need (see Wireless Upgrader). 3. Sneak + Punch an Access Point with the Wireless Access Pad - if successful, you will see a short message appear. 4. Use the Wireless Access Pad from anywhere within its current range to open the Access Point and take or store items remotely! If you need more range, just place it in a Wireless Upgrader and repeat the upgrade process!
ru: Беспроводная панель доступа — это портативное устройство, которое позволяет получить доступ к вашему сетевому хранилищу с потенциально неограниченного расстояния, синхронизируясь с точкой доступа в вашей сети. (расстояние может быть ограничено настройками сервера, см. страницу настроек сервера слева) Беспроводная панель доступа не имеет отношения к Беспроводному передатчику или приемнику. Для панели требуется только точка доступа. Беспроводная панель доступа предоставляет точно такой же интерфейс, как и точка доступа, позволяя вам класть или извлекать предметы и жидкости. Чтобы использовать беспроводную панель доступа: 1. Создайте ее с помощью рецепта. Совет: Беспроводные кристаллы изготавливаются в Лавовой печи. 2. Создайте Беспроводной модернизатор и используйте его для улучшения вашей беспроводной панели доступа столько раз, сколько нужно (см. Беспроводной модернизатор). 3. Зажмите Shift + Ударьте по точке доступа беспроводной панелью — если всё прошло успешно, вы увидите короткое сообщение. 4. Используйте беспроводную панель доступа откуда угодно в пределах ее текущего радиуса, чтобы открыть точку доступа и удаленно забирать или класть предметы! Если вам нужен больший радиус, просто поместите панель в Беспроводной модернизатор и повторите процесс улучшения!
